{
  "type": "books",
  "title": "Doing Good Better",
  "author": "William MacAskill",
  "review": "I learned a lot from this book. The first part, focused on explaining the core tenants behind donating effectively, illustrates the counter-intuitive nature behind what success means in the non-profit and philanthropic world. After reading this book, I have a greater appreciation for how pressing the issue of global poverty is and how much difference can be made my people in the west for a relatively low amount of money. The book provides a framework for evaluating charities by their true impact and focusing on testing and proven methods rather than methods that merely look good or are well-marketed.\n\nThe second part of the book talks about how to be an effective altruist. The biggest decision that impacts our ability to make a positive impact in the world is how we choose to spend our career. We spend about 80,000 hours working and, more than any side project or passion project, it will be the greatest influence on our ability to make a positive difference. \n\nThe core thesis is that early in your career, it is beneficial to gain skills, credentials, and connections that then allow you to better leverage yourself for good in the future. Often times, this is best done in industry rather than in non-profit work. While gaining those skills, one can “earn to give” so that their work does still result in some good around the world. However, we should be careful of moral licensing - the idea that doing one good action is compensated by doing fewer good actions in the future.\n\nFor myself, I am going to take the following steps towards becoming an effective altruist: \n\n1) Donate 10% of my post-tax income each month ($250 / month) to effective charities while I am still making our seed-stage salary. Once my salary increases, I will plan to increase that amount. Additionally, I want to do some light searching for some lucrative hourly contracting roles that might allow me to make an extra $3-4k a month that I could focus primarily for donating.\n\n2) Discuss EA my co-founders and pledge some % of my equity towards charity. The book talks about tech entrepreneurship as one of the high expected value ways to earn to give. Thinking about the potential for change that could come from Explo doing well has reframed my motivation for the company and I am curious to learn how others on the team would feel knowing that a significant portion of the company’s value is pledged to charity.\n\n3) Discuss EA with other YC founders and potentially create a pledge among YC founders to donate some portion of their earnings when the company exits. This would be powerful because it increases the chance that at least one company ultimately succeeds and makes a donation.",
  "date": "2022-01-14"
}
