{
  "type": "books",
  "title": "Uncanny Valley",
  "author": "Anna Wiener",
  "review": "I’ve been in technology my whole career. I am also a software engineer. First as a rank-and-file engineer for a philanthropy run by the social media company everyone hates and now as a startup founder funded by the seed accelerator.\n\nWhat was so fascinating about reading this was that most of the main characters and companies she spoke of have recently entered into orbit around my world. The CEO of the analytics startup and Patrick are part of the seed accelerator community that I’m a part of. I’ve seen or been involved in internal online discussions with them. The founder of the seed accelerator is someone that people look up to a lot. The on-demand housemaid founder, who launched the seed accelerator’s “new cities” project, even interviewed us for our application.\n\nThe author’s general description of the tech entrepreneur is more or less profiling myself and my peers. Even before I started this company, me and my software engineering friends definitely fit the mold she described of engineers at her companies.\n\nInsofar as this book is a critique on Silicon Valley, it is also a critique on many aspects of what my life has been up to this point. I appreciated her perspective as someone who experiences tech very differently than me, being both a woman and not an engineer.\n\nDuring my first job, at the large government tech organization everyone is paranoid about, I saw first hand how striking the gender gap in tech is. The office I worked at was 80% male. I felt the lack of gender diversity both in my work and in the culture. My second job, at the philanthropy of the social media company that everyone hates, was much more diverse. In fact, for large chunks of time there, every person on my direct team was a women and most of leadership was women. It was a striking difference, a rarity, and a breathe of fresh air.\n\nOn the first day of the seed accelerator’s in-person programming, the first thing I noticed was that there were a lot of dudes here. I later learned that the seed accelerator has made lots of gains in diversity and cares a lot about this. However, even so, the lack of representation was clear to see.\n\nThe author wonders what drives someone to start a company and sacrifice so much. Money? Expectations? Parents? Something else?\n\nFor me, the truthful answer is: all of the above. But all of those factors are things that would face me no matter what my job was. What really drives me to channel all this energy into the startup is a strong desire to overcome crushing adversity and prove to myself that I can do it, or that I am at least willing to try.\n\nAs a software engineer from a strong technical college, it is hard for me to fail. This is extremely privileged to say, but it is the truth. As the author points out, I am highly employable and have no issues finding jobs. Once in a job, my path is laid out quite clearly. Write good code, get promoted, tech lead a team, get promoted, manage engineers, get promoted, on, and on, and on. There might be mistakes and hiccups here and there, but, if I stayed committed to it, the chance of falling off this path is low.\n\nIn contrast, the chance of failure with this startup is almost guaranteed. Most startups fail before they get to the seed stage. We got to the seed stage. Unfortunately, most startups fail after the seed stage. If I were feeling generous, given everything we have working in our favor, I’d give us a 10% chance of any sort of positive outcome. And again, that’s quite generous.\n\nI feel extremely energized and excited to wake up everyday and confront the odds of the task we have ahead of us. We have to scrape and claw our way for every small step we take in the right direction. Every milestone is so sweet because of every lucky break we knew it took to achieve it. By the time we’re done, success or not, I’ll be proud of our team, everything we accomplished, and everything we aspired to accomplish.\n\nSimilar to an author writing a book, an athlete playing in a big game, or an architect designing a building, this startup is how I am channeling my craft (not to say that I’m an expert at it). Maybe it will fail next week, or maybe I’ll be working on it for the next 10 years. Either way, I hope that our company is not filled with all the shortcomings, sexism, and arrogance that this book details.",
  "date": "2021-01-26"
}
