{
  "type": "thoughts",
  "title": "Finding Friendship",
  "content": "During high school and college, it was relatively effortless for me to feel fulfilled socially. I recognize this isn’t a universal feeling, but it was true for me. I had all of my closest friends in immediate proximity to myself and almost never had to make explicit plans to hang out because it would naturally happen with classes, extra curricular, and friend groups.\n\nAfter college in DC, I was relatively alone in a new city with just my partner and no other close friends. I assumed that my job would play the same role as school and be a medium for me to fulfill my social needs. However, I learned that friendship as a working adult looks and feels very different than as a student.\n\nFor one, all of my closest friends didn’t live in the same city as me - they were spread out over SF, Seattle, New York, and Pittsburgh. If I didn’t put in the effort to call them and text them, months could pass without any meaningful interactions. \n\nSecondly, spending time with friends I made through work was not effortless. When you work with folks who have kids, hobbies, and a grueling job, explicit plans are mandatory, not optional, in order to spend time together. \n\nWhen I moved to Redwood City, I lived with two of my closest friends from high school. This was the first time I lived with close friends and I got to experience a social dynamic that felt a lot closer to school. It was fun, but I was joining a pre-existing group and felt like a bit of an outsider at times.\n\nThen I moved to SF, got a place with my partner, and promptly sheltered in places for the next 2 years due to the pandemic.\n\nThe pandemic was terrible for many reasons, but one good that did come out of it made me intentional about maintaining relationships with those closest to me. Every friendship became a long distance relationship. My friends who lived across the street were just as accessible as my friends who lived across the country. I had to plan every social interaction I had, lest I stay locked up in my room working all day.\n\nAn important lesson learned during the pandemic, once I started investing more into spending time with my friends, was the importance of choosing who to spend my time with. In the past, I have been susceptible to spending time with groups of friends that have different values than me and generally don’t bring me positive energy. Since it is so easy to feel lonely, it also becomes easy to cling on to any friendships I can find.\n\nThis year I hope to focus on building deep and meaningful relationships with a handful of people in SF, while also increasing the depth of connection with my close friends not in the city.",
  "date": "2022-01-25"
}
